windycore/CompanyMaterial-/stm32-mainboard/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/src/Uart2.c
    return((((ulWrite + 1) % ulSize) == ulRead) ? true : false);
}
#endif

//*****************************************************************************
//
//! Determines whether the ring buffer whose pointers and size are provided
//! is empty or not.
//!
//! \param pulRead points to the read index for the buffer.
//! \param pulWrite points to the write index for the buffer.
//!
//! This function is used to determine whether or not a given ring buffer is
//! empty.  The structure of the code is specifically to ensure that we do not
//! see warnings from the compiler related to the order of volatile accesses
//! being undefined.
//!
//! \return Returns \b true if the buffer is empty or \b false otherwise.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static tBoolean
IsBufferEmpty(volatile unsigned long *pulRead,
              volatile unsigned long *pulWrite)
{
    unsigned long ulWrite;
    unsigned long ulRead;

    ulWrite = *pulWrite;
    ulRead = *pulRead;

    return((ulWrite  == ulRead) ? true : false);
}
#endif

//*****************************************************************************
//
//! Determines the number of bytes of data contained in a ring buffer.
//!
//! \param pulRead points to the read index for the buffer.
//! \param pulWrite points to the write index for the buffer.
//! \param ulSize is the size of the buffer in bytes.
//!
//! This function is used to determine how many bytes of data a given ring
//! buffer currently contains.  The structure of the code is specifically to
//! ensure that we do not see warnings from the compiler related to the order
//! of volatile accesses being undefined.
//!
//! \return Returns the number of bytes of data currently in the buffer.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static unsigned long
GetBufferCount(volatile unsigned long *pulRead,
               volatile unsigned long *pulWrite, unsigned long ulSize)
{
    unsigned long ulWrite;
    unsigned long ulRead;

    ulWrite = *pulWrite;
    ulRead = *pulRead;

    return((ulWrite >= ulRead) ? (ulWrite - ulRead) :
                                 (ulSize - (ulRead - ulWrite)));
}
#endif

//*****************************************************************************
//
// Take as many bytes from the transmit buffer as we have space for and move
// them into the UART transmit FIFO.
//
//*****************************************************************************
#if 0  // def UART_BUFFERED
//发送部分数据
static void
UARTPrimeTransmit(unsigned long ulBase)
{
#if 0
    //
    // Do we have any data to transmit?
    //
    if (!TX_BUFFER_EMPTY)
    {
        //
        // Disable the UART interrupt. If we don't do this there is a race
        // condition which can cause the read index to be corrupted.
        //
        MAP_IntDisable(g_ulUARTInt[g_ulPortNum]);

        //
        // Yes - take some characters out of the transmit buffer and feed
        // them to the UART transmit FIFO.
        //
        while(MAP_UARTSpaceAvail(ulBase) && !TX_BUFFER_EMPTY)
        {
            MAP_UARTCharPutNonBlocking(ulBase,
                                       g_pcUARTTxBuffer[g_ulUARTTxReadIndex]);
            ADVANCE_TX_BUFFER_INDEX(g_ulUARTTxReadIndex);
        }

        //
        // Reenable the UART interrupt.
        //
        MAP_IntEnable(g_ulUARTInt[g_ulPortNum]);

    }
#else
	unsigned char ucChar;
	bool_t isTxSpaceAvailable;
	bool_t isUseUsb = FALSE;//SiiPlatformUsbIsComOpen();

    //
    // Do we have any data to transmit?
    //
    if(!TX_BUFFER_EMPTY)
    {

        //
        // Disable the UART interrupt. If we don't do this there is a race
        // condition which can cause the read index to be corrupted.
        //
        //_MAP_IntDisable(g_ulUARTInt[g_ulPortNum]);
        //_if(isUseUsb)
        //_{
        //_MAP_IntDisable(INT_USB0);
        //_}

        //
        // Yes - take some characters out of the transmit buffer and feed
        // them to the UART transmit FIFO.
        //

        do
        {
        	isTxSpaceAvailable = MAP_UARTSpaceAvail(ulBase) && !TX_BUFFER_EMPTY;

        	// Look to see if USB is connected and has space,
        	// if UART TX can accept input.

        	if (isTxSpaceAvailable)
        	{
        		ucChar = g_pcUARTTxBuffer[g_ulUARTTxReadIndex];
        		MAP_UARTCharPutNonBlocking(ulBase, ucChar);
        		
            	ADVANCE_TX_BUFFER_INDEX(g_ulUARTTxReadIndex);

        	}
        } while (isTxSpaceAvailable);

        //
        // Reenable the UART interrupt.
        //
        //_MAP_IntEnable(g_ulUARTInt[g_ulPortNum]);
       //_ if(isUseUsb)
       //_ {
       //_ MAP_IntEnable(INT_USB0);
        //_}

    }

#endif
}
#endif

//*****************************************************************************
//
//! Initializes the UART console.
//!
//! \param ulPortNum is the number of UART port to use for the serial console
//! (0-2)
//!
//! This function will initialize the specified serial port to be used as a
//! serial console.  The serial parameters will be set to 115200, 8-N-1.
//! An application wishing to use a different baud rate may call
//! SiiPlatformUartExpClkInit() instead of this function.
//!
//! This function or SiiPlatformUartExpClkInit() must be called prior to using any
//! of the other UART console functions: SiiPlatformUartPrintf() or SiiPlatformUartGets().  In order
//! for this function to work correctly, SysCtlClockSet() must be called prior
//! to calling this function.
//!
//! It is assumed that the caller has previously configured the relevant UART
//! pins for operation as a UART rather than as GPIOs.
//!
//! \return None.
//
//*****************************************************************************
void SiiPlatformUartInit(unsigned long ulPortNum, unsigned long ulBaud)
{
    //
    // Initialize the Arm UART 0 peripheral
    //

    //_ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    //_ROM_GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    //
    // Pass this call on to the version of the function allowing the baud rate
    // to be specified.
    //
    //_SiiPlatformUartExpClkInit(ulPortNum, ulBaud);
}

//*****************************************************************************
//
//! Initializes the UART console and allows the baud rate to be selected.
//!
//! \param ulPortNum is the number of UART port to use for the serial console
//! (0-2)
//! \param ulBaud is the bit rate that the UART is to be configured to use.
//!
//! This function will initialize the specified serial port to be used as a
//! serial console.  The serial parameters will be set to 8-N-1 and the bit
//! rate set according to the value of the \e ulBaud parameter.
//!
//! This function or SiiPlatformUartInit() must be called prior to using any of the
//! other UART console functions: SiiPlatformUartPrintf() or SiiPlatformUartGets().  In order for
//! this function to work correctly, SysCtlClockSet() must be called prior to
//! calling this function.  An application wishing to use 115,200 baud may call
//! SiiPlatformUartInit() instead of this function but should not call both
//! functions.
//!
//! It is assumed that the caller has previously configured the relevant UART
//! pins for operation as a UART rather than as GPIOs.
//!
//! \return None.
//
//*****************************************************************************
#if 0
void
SiiPlatformUartExpClkInit(unsigned long ulPortNum, unsigned long ulBaud)
{
    //
    // Check the arguments.
    //
    ASSERT((ulPortNum == 0) || (ulPortNum == 1) ||
           (ulPortNum == 2));

