windycore/CompanyMaterial-/stm32-mainboard/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/src/Uart2.c
void SiiPlatformUartPutc ( char outChar )
{

    SiiPlatformUartWrite( (const unsigned char  *)&outChar, 1 );
}

//------------------------------------------------------------------------------
// Function:    SiiPlatformUartPutcUnfiltered
// Description: Sends a single byte to the UART
//------------------------------------------------------------------------------

void SiiPlatformUartPutcUnfiltered ( char outChar )
{

    //crlfFilter = false;
    SiiPlatformUartWrite( (const unsigned char  *)&outChar, 1 );
}


//*****************************************************************************
//
//! Returns the number of bytes available in the receive buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to determine the number
//! of bytes of data currently available in the receive buffer.
//!
//! \return Returns the number of available bytes.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
int
SiiPlatformUartRxBytesAvail(void)
{
    return(RX_BUFFER_USED);
}
#endif

#if defined(UART_BUFFERED) || defined(DOXYGEN)
//*****************************************************************************
//
//! Returns the number of bytes free in the transmit buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to determine the amount
//! of space currently available in the transmit buffer.
//!
//! \return Returns the number of free bytes.
//
//*****************************************************************************
int
SiiPlatformUartTxBytesFreeGet(void)
{
    return(TX_BUFFER_FREE);
}
#endif

//*****************************************************************************
//
//! Flushes the receive buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to discard any data
//! received from the UART but not yet read using SiiPlatformUartGets().
//!
//! \return None.
//
//*****************************************************************************
#if 0 // defined(UART_BUFFERED) || defined(DOXYGEN)
void
SiiPlatformUartFlushRx(void)
{
    unsigned long ulInt;

    //
    // Temporarily turn off interrupts.
    //
    ulInt = ROM_IntMasterDisable();

    //
    // Flush the receive buffer.
    //
    g_ulUARTRxReadIndex = 0;
    g_ulUARTRxWriteIndex = 0;

    //
    // If interrupts were enabled when we turned them off, turn them
    // back on again.
    //
    if (!ulInt)
    {
        ROM_IntMasterEnable();
    }
}
#endif

//*****************************************************************************
//
//! Flushes the transmit buffer.
//!
//! \param bDiscard indicates whether any remaining data in the buffer should
//! be discarded (\b true) or transmitted (\b false).
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to flush the transmit
//! buffer, either discarding or transmitting any data received via calls to
//! SiiPlatformUartPrintf() that is waiting to be transmitted.  On return, the transmit
//! buffer will be empty.
//!
//! \return None.
//
//*****************************************************************************
#if  0//defined(UART_BUFFERED) || defined(DOXYGEN)
void
SiiPlatformUartFlushTx(tBoolean bDiscard)
{
    unsigned long ulInt;

    //
    // Should the remaining data be discarded or transmitted?
    //
    if (bDiscard)
    {
        //
        // The remaining data should be discarded, so temporarily turn off
        // interrupts.
        //
       //_ ulInt = ROM_IntMasterDisable();

        //
        // Flush the transmit buffer.
        //
       // g_ulUARTTxReadIndex = 0;
       // g_ulUARTTxWriteIndex = 0;

        //
        // If interrupts were enabled when we turned them off, turn them
        // back on again.
        //
        if (!ulInt)
        {
            //_ROM_IntMasterEnable();
        }
    }
    else
    {
        //
        // Wait for all remaining data to be transmitted before returning.
        //
        while(!TX_BUFFER_EMPTY)
        {
        }
    }
}
#endif

//*****************************************************************************
//
//! Read a single character from the UART, blocking if necessary.
//!
//! This function will receive a single character from the UART and store it at
//! the supplied address.
//!
//! In both buffered and unbuffered modes, this function will block until a
//! character is received.  If non-blocking operation is required in buffered
//! mode, a call to UARTRxAvail() may be made to determine whether any
//! characters are currently available for reading.
//!
//! \return Returns the character read.
//
//*****************************************************************************
BOOL SiiPlatformUartGetc(unsigned char *pchar)
{
#ifdef UART_BUFFERED
    //unsigned char cChar;

    //
    // Wait for a character to be received.
    //
    if(RX_BUFFER_EMPTY)
    {
        //
        // Block waiting for a character to be received (if the buffer is
        // currently empty).
        //
      return FALSE; // add by kyq
    }

    //
    // Read a character from the buffer.
    //
    *pchar = g_pcUARTRxBuffer[g_ulUARTRxReadIndex];
    ADVANCE_RX_BUFFER_INDEX(g_ulUARTRxReadIndex);

    //
    // Return the character to the caller.
    //
    return(TRUE);
#else
    //
    // Block until a character is received by the UART then return it to
    // the caller.
    //
    return(MAP_UARTCharGet(g_ulBase));
#endif
}

//*****************************************************************************
//
//! Handles UART interrupts.
//!
//! This function handles interrupts from the UART.  It will copy data from the
//! transmit buffer to the UART transmit FIFO if space is available, and it
//! will copy data from the UART receive FIFO to the receive buffer if data is
//! available.
//!
//! \return None.
//
//*****************************************************************************

