windycore/CompanyMaterial-/stm32-mainboard/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/src/Uart2.c
#if defined(UART_BUFFERED) || defined(DOXYGEN)
//void SiiPlatformUartIntHandler(void)

#endif

void SiiPlatformUartCrlfFilterSet ( bool_t enable )
{
    //crlfFilter = enable;
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

















#if 1

void USART2_IRQHandler(void)
{
    BYTE cChar;
    static BYTE cLastChar = 0;
    if (USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)
    {
        cChar = USART2->DR;

#if 0

		
        if (USART2_rxpoint < (USART2_RX_BUFF + USART2_RX_BUFF_MAX))
            *USART2_rxpoint++ = cData;

        if (USART2_rxpoint >= (USART2_RX_BUFF + USART2_RX_BUFF_MAX))
        {
            USART2_rxpoint = USART2_RX_BUFF;

        }

#endif

        	//Do not store the char if buffer full
        	if (!RX_BUFFER_FULL)
        	{
		        // Read a character	
		    // 连续两个0xff 丢掉一个
		 if(!((cChar == 0xff)&&(cLastChar == 0xff)))  // it's seem some time will be lost data
		 	{
        	         g_pcUARTRxBuffer[g_ulUARTRxWriteIndex] =cChar;
            	         ADVANCE_RX_BUFFER_INDEX(g_ulUARTRxWriteIndex);	
			  cLastChar = cChar;
		 	}
        	}
#if 0
			//processing the packets.
        	if (!SkSerialConsumedChar()) // isBuffInUse == false
        	{
                SkSerialRxHandler( SiiPlatformUartGetc());
            }
#endif



    }
    //else  UART_temp = USART1->DR;  //串口清中断是当你读走数据后硬件自动完成清中断

    if (USART_GetITStatus(USART2, USART_IT_ORE) != RESET)
    {
        USART_ClearFlag(USART2, USART_IT_ORE);
        cChar = USART2->DR;  //串口清中断是当你读走数据后硬件自动完成清中断
    }

}
#endif


void UART2_SendByte(u16 Data)
{
   #if 1
    while (!(USART2->SR & USART_FLAG_TXE));
    USART2->DR = (Data & (uint16_t)0x01FF);
    while (!(USART2->SR & USART_FLAG_TC));
	#endif
}

void UART2_SendBytes(const unsigned char  *Data, u8 num)
{
    u8 i = 0;
    for (i = 0; i < num; i++)	  UART2_SendByte(*(Data + i));
}

void UART2_Init(void)
{
    //USART2_rxpoint = USART2_RX_BUFF;
    //crlfFilter = true;   // default
    g_ulUARTRxReadIndex = 0;
    g_ulUARTRxWriteIndex = 0; 
    g_ulUARTTxWriteIndex = 0;
    g_ulUARTTxReadIndex = 0;

}

